aalib
abseil-cpp
accountsservice
acl
acpid
adw-gtk-theme
adwaita-cursors
adwaita-dark
adwaita-fonts
adwaita-icon-theme
adwaita-icon-theme-legacy
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
alsa-utils
aom
apache
apparmor
appstream
appstream-glib
apr
apr-util
archlinux-appstream-data
archlinux-keyring
argon2
asciidoc
at-spi2-core
attr
audit
autoconf
automake
avahi
babl
backintime
backintime-cli
baobab
base
base-devel
bash
bash-completion
biber
binutils
bison
blas
bluez
bluez-libs
bluez-obex
bolt
boost-libs
bottom
breeze-icons
brltty
brotli
btop
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm-1.16
cantarell-fonts
cdparanoia
chromaprint
cifs-utils
clucene
code
colord
colord-gtk-common
colord-gtk4
colord-sane
composefs
containerd
coreutils
cosmic-app-library
cosmic-applet-arch
cosmic-applet-arch-debug
cosmic-applets
cosmic-bg
cosmic-comp
cosmic-files
cosmic-greeter
cosmic-icon-theme
cosmic-idle
cosmic-launcher
cosmic-notifications
cosmic-osd
cosmic-panel
cosmic-randr
cosmic-screenshot
cosmic-session
cosmic-settings
cosmic-settings-daemon
cosmic-wallpapers
cosmic-workspaces
cracklib
cronie
cryptsetup
cups
cups-browsed
cups-filters
cups-pk-helper
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dbus-units
dconf
debugedit
decibels
default-cursors
desktop-file-utils
device-mapper
diffutils
djvulibre
dkms
docbook-xml
docbook-xsl
docker
dotconf
double-conversion
duktape
dvisvgm
e2fsprogs
editorconfig-core-c
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron
electron35
electron36
ell
enchant
epiphany
evince
evolution-data-server
exempi
exiv2
expat
faac
faad2
fakeroot
fastfetch
fd
ffcall
ffmpeg
fftw
file
filesystem
findutils
firefox
flac
flatpak
flex
fluidsynth
folks
fontconfig
fprintd
freeglut
freerdp
freetype2
fribidi
fuse-common
fuse3
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gd
gdbm
gdk-pixbuf2
gdm
gdu
gegl
geoclue
geocode-glib-2
geocode-glib-common
gettext
ghc-libs
ghostscript
giflib
gimp
git
gjs
glib-networking
glib2
glib2-devel
glib2-docs
glibc
glibmm-2.68
glslang
glu
glycin
gmp
gnome-app-list
gnome-autoar
gnome-backgrounds
gnome-bluetooth-3.0
gnome-calculator
gnome-calendar
gnome-characters
gnome-clocks
gnome-color-manager
gnome-connections
gnome-control-center
gnome-desktop
gnome-desktop-4
gnome-desktop-common
gnome-disk-utility
gnome-font-viewer
gnome-icon-theme-extras
gnome-icon-theme-symbolic
gnome-keybindings
gnome-keyring
gnome-logs
gnome-maps
gnome-menus
gnome-mimeapps
gnome-music
gnome-online-accounts
gnome-remote-desktop
gnome-session
gnome-settings-daemon
gnome-shell
gnome-shell-extension-desktop-icons-ng
gnome-shell-extensions
gnome-software
gnome-system-monitor
gnome-text-editor
gnome-tour
gnome-tweaks
gnome-user-docs
gnome-user-share
gnome-weather
gnulib-l10n
gnupg
gnutls
go
gobject-introspection
gobject-introspection-runtime
gom
gperftools
gpgme
gpgmepp
gpm
graphene
graphite
graphviz
greetd
greetd-agreety
grep
grilo
grilo-plugins
groff
gsettings-desktop-schemas
gsettings-system-schemas
gsfonts
gsm
gsound
gspell
gssdp
gst-devtools-libs
gst-editing-services
gst-plugin-gtk
gst-plugin-gtk4
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-python
gstreamer
gtest
gtk-doc
gtk-update-icon-cache
gtk-vnc
gtk2
gtk3
gtk4
gtkmm-4.0
gtksourceview4
gtksourceview5
gts
guile
gupnp
gupnp-av
gupnp-dlna
gupnp-igd
gvfs
gvfs-afc
gvfs-dnssd
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-onedrive
gvfs-smb
gvfs-wsdd
gzip
harfbuzz
harfbuzz-icu
haskell-aeson
haskell-aeson-pretty
haskell-ansi-terminal
haskell-ansi-terminal-types
haskell-ansi-wl-pprint
haskell-appar
haskell-asn1-encoding
haskell-asn1-parse
haskell-asn1-types
haskell-assoc
haskell-async
haskell-attoparsec
haskell-attoparsec-aeson
haskell-attoparsec-iso8601
haskell-auto-update
haskell-base-compat
haskell-base-compat-batteries
haskell-base-orphans
haskell-base-unicode-symbols
haskell-base16-bytestring
haskell-base64-bytestring
haskell-basement
haskell-bifunctors
haskell-bitvec
haskell-blaze-builder
haskell-blaze-html
haskell-blaze-markup
haskell-boring
haskell-bsb-http-chunked
haskell-byteorder
haskell-call-stack
haskell-case-insensitive
haskell-cassava
haskell-cereal
haskell-citeproc
haskell-cmdargs
haskell-colour
haskell-commonmark
haskell-commonmark-extensions
haskell-commonmark-pandoc
haskell-comonad
haskell-conduit
haskell-conduit-extra
haskell-constraints
haskell-contravariant
haskell-cookie
haskell-crypton
haskell-crypton-connection
haskell-crypton-x509
haskell-crypton-x509-store
haskell-crypton-x509-system
haskell-crypton-x509-validation
haskell-data-default
haskell-data-default-class
haskell-data-default-instances-containers
haskell-data-default-instances-dlist
haskell-data-default-instances-old-locale
haskell-data-fix
haskell-dec
haskell-digest
haskell-distributive
haskell-djot
haskell-dlist
haskell-doclayout
haskell-doctemplates
haskell-easy-file
haskell-emojis
haskell-erf
haskell-fast-logger
haskell-file-embed
haskell-foldable1-classes-compat
haskell-generically
haskell-glob
haskell-gridtables
haskell-haddock-library
haskell-hashable
haskell-hourglass
haskell-hslua
haskell-hslua-aeson
haskell-hslua-classes
haskell-hslua-core
haskell-hslua-list
haskell-hslua-marshalling
haskell-hslua-module-doclayout
haskell-hslua-module-path
haskell-hslua-module-system
haskell-hslua-module-text
haskell-hslua-module-version
haskell-hslua-module-zip
haskell-hslua-objectorientation
haskell-hslua-packaging
haskell-hslua-repl
haskell-hslua-typing
haskell-http-api-data
haskell-http-client
haskell-http-client-tls
haskell-http-date
haskell-http-media
haskell-http-types
haskell-http2
haskell-hunit
haskell-indexed-traversable
haskell-indexed-traversable-instances
haskell-integer-logarithms
haskell-iproute
haskell-ipynb
haskell-isocline
haskell-jira-wiki-markup
haskell-juicypixels
haskell-lexer
haskell-libyaml
haskell-lpeg
haskell-lua
haskell-memory
haskell-mime-types
haskell-mmorph
haskell-monad-control
haskell-mono-traversable
haskell-network
haskell-network-byte-order
haskell-network-uri
haskell-old-locale
haskell-old-time
haskell-onetuple
haskell-only
haskell-optparse-applicative
haskell-ordered-containers
haskell-os-string
haskell-pandoc
haskell-pandoc-lua-engine
haskell-pandoc-lua-marshal
haskell-pandoc-server
haskell-pandoc-types
haskell-pem
haskell-pretty-show
haskell-prettyprinter
haskell-primitive
haskell-psqueues
haskell-quickcheck
haskell-random
haskell-recv
haskell-regex-base
haskell-regex-tdfa
haskell-resourcet
haskell-safe
haskell-safe-exceptions
haskell-scientific
haskell-semialign
haskell-semigroupoids
haskell-servant
haskell-servant-server
haskell-sha
haskell-simple-sendfile
haskell-singleton-bool
haskell-skylighting
haskell-skylighting-core
haskell-skylighting-format-ansi
haskell-skylighting-format-blaze-html
haskell-skylighting-format-context
haskell-skylighting-format-latex
haskell-socks
haskell-some
haskell-sop-core
haskell-split
haskell-splitmix
haskell-statevar
haskell-streaming-commons
haskell-strict
haskell-syb
haskell-tagged
haskell-tagsoup
haskell-tasty
haskell-temporary
haskell-texmath
haskell-text-conversions
haskell-text-icu
haskell-text-short
haskell-th-abstraction
haskell-th-compat
haskell-th-lift
haskell-th-lift-instances
haskell-these
haskell-time-compat
haskell-time-manager
haskell-tls
haskell-toml-parser
haskell-transformers-base
haskell-transformers-compat
haskell-type-equality
haskell-typed-process
haskell-typst
haskell-typst-symbols
haskell-unicode-collation
haskell-unicode-data
haskell-unicode-transforms
haskell-uniplate
haskell-unix-compat
haskell-unix-time
haskell-unliftio
haskell-unliftio-core
haskell-unordered-containers
haskell-utf8-string
haskell-uuid-types
haskell-vault
haskell-vector
haskell-vector-algorithms
haskell-vector-stream
haskell-wai
haskell-wai-app-static
haskell-wai-cors
haskell-wai-extra
haskell-wai-logger
haskell-warp
haskell-witherable
haskell-word8
haskell-xml
haskell-xml-conduit
haskell-xml-types
haskell-yaml
haskell-zip-archive
haskell-zlib
hicolor-icon-theme
hidapi
highway
hslua-cli
hunspell
hwdata
hyphen
iana-etc
icu
iio-sensor-proxy
ijs
imagemagick
imath
imlib2
intel-ucode
intltool
iproute2
iptables
iputils
iso-codes
iwd
jansson
jasper
jbig2dec
jbigkit
js128
json-c
json-glib
just
karchive
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcolorscheme
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
keyd
keyutils
kglobalaccel
kguiaddons
ki18n
kiconthemes
kio
kirigami
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmod
knotifications
kpackage
krb5
kservice
ksvg
kwallet
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
lame
lapack
latex2html
lazygit
lcms2
ldb
leancrypto
lensfun
less
libabw
libadwaita
libao
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libavtp
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcaca
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcmis
libcolord
libcue
libcups
libcupsfilters
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdmapsharing
libdovi
libdrm
libdv
libdvdnav
libdvdread
libe-book
libebur128
libedataserverui4
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfprint
libfreeaptx
libfreehand
libgcrypt
libgdata
libgdm
libgee
libgexiv2
libgirepository
libglvnd
libgme
libgnomekbd
libgoa
libgpg-error
libgphoto2
libgsf
libgtop
libgudev
libgusb
libgweather-4
libgxps
libhandy
libheif
libibus
libical
libice
libidn
libidn2
libiec61883
libieee1284
libimobiledevice
libimobiledevice-glue
libinih
libinput
libinstpatch
libiptcdata
libisl
libixion
libjpeg-turbo
libjxl
libksba
liblangtag
liblc3
libldac
libldap
liblouis
liblqr
liblrdf
libltc
libluv
liblzf
libmalcontent
libmanette
libmd
libmediaart
libmicrodns
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmspub
libmtp
libmwaw
libmypaint
libmysofa
libnautilus-extension
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnma-gtk4
libnotify
libnsl
libnumbertext
libnvme
liboauth
libodfgen
libogg
libopenmpt
liborcus
libosinfo
libp11-kit
libpagemaker
libpamac-full
libpamac-full-debug
libpaper
libpcap
libpciaccess
libpeas
libpgm
libphonenumber
libpipeline
libpipewire
libplacebo
libplasma
libplist
libpng
libportal
libportal-gtk3
libportal-gtk4
libppd
libproxy
libpsl
libpulse
libpwquality
libqalculate
libqxp
libraqm
libraw
libraw1394
libreoffice-still
librest
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecret
libshout
libshumate
libsigc++-3.0
libsigsegv
libsixel
libsm
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libspeechd
libspelling
libspiro
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtpms
libunibreak
libunistring
libunwind
liburing
libusb
libusbmuxd
libutf8proc
libuv
libva
libvdpau
libverto
libvisio
libvncserver
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwmf
libwnck3
libwpd
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-amdgpu
linux-firmware-atheros
linux-firmware-broadcom
linux-firmware-cirrus
linux-firmware-intel
linux-firmware-mediatek
linux-firmware-nvidia
linux-firmware-other
linux-firmware-radeon
linux-firmware-realtek
linux-firmware-whence
lld
llvm-libs
lm_sensors
lmdb
localsearch
loupe
lpsolve
lua
lua-lpeg
lua51-lpeg
luajit
lv2
lz4
lzo
m4
mailcap
make
malcontent
man-db
man-pages
md4c
mdadm
media-player-info
mesa
meson
minimon-applet-for-cosmic
minimon-applet-for-cosmic-debug
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mod_dnssd
mpdecimal
mpfr
mpg123
mpv
msgpack-c
msgraph
mtdev
mujs
mutter
mypaint-brushes1
nautilus
ncurses
neon
neovim
net-snmp
netpbm
nettle
networkmanager
networkmanager-iwd-overlay
ninja
nm-connection-editor
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-emoji
npm
npth
nspr
nss
numactl
ocl-icd
oniguruma
openal
opencore-amr
openexr
openh264
openjpeg2
openssh
openssl
opus
orc
orca
osinfo-db
ostree
oxygen-icons
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pam-fprint-grosshack-unlimited-timeout
pam-fprint-grosshack-unlimited-timeout-debug
pamac-all
pamac-all-debug
pamac-cli
pamac-cli-debug
pambase
pandoc-cli
pango
pangomm-2.48
parted
patch
pciutils
pcre
pcre2
pcsclite
perl
perl-alien-build
perl-alien-libxml2
perl-autovivification
perl-b-hooks-endofscope
perl-business-isbn
perl-business-isbn-data
perl-business-ismn
perl-business-issn
perl-capture-tiny
perl-class-accessor
perl-class-data-inheritable
perl-class-inspector
perl-class-load
perl-class-singleton
perl-clone
perl-clone-choose
perl-data-compare
perl-data-dump
perl-data-optlist
perl-data-uniqid
perl-datetime
perl-datetime-calendar-julian
perl-datetime-format-builder
perl-datetime-format-strptime
perl-datetime-locale
perl-datetime-timezone
perl-devel-stacktrace
perl-dist-checkconflicts
perl-encode-locale
perl-error
perl-eval-closure
perl-exception-class
perl-exporter-tiny
perl-ffi-checklib
perl-file-chdir
perl-file-find-rule
perl-file-listing
perl-file-sharedir
perl-file-sharedir-install
perl-file-slurp-tiny
perl-file-slurper
perl-file-which
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-io-socket-ssl
perl-io-string
perl-ipc-run3
perl-libwww
perl-lingua-translit
perl-list-allutils
perl-list-moreutils
perl-list-moreutils-xs
perl-list-someutils
perl-list-utilsby
perl-log-log4perl
perl-lwp-mediatypes
perl-lwp-protocol-https
perl-mailtools
perl-math-round
perl-mime-charset
perl-module-implementation
perl-module-runtime
perl-mozilla-ca
perl-mro-compat
perl-namespace-autoclean
perl-namespace-clean
perl-net-http
perl-net-ssleay
perl-number-compare
perl-package-deprecationmanager
perl-package-stash
perl-package-stash-xs
perl-params-util
perl-params-validate
perl-params-validationcompiler
perl-parse-recdescent
perl-path-tiny
perl-perlio-utf8-strict
perl-regexp-common
perl-role-tiny
perl-sort-key
perl-specio
perl-sub-exporter
perl-sub-exporter-progressive
perl-sub-install
perl-test-fatal
perl-text-bibtex
perl-text-csv
perl-text-glob
perl-text-roman
perl-tie-cycle
perl-timedate
perl-try-tiny
perl-unicode-linebreak
perl-uri
perl-variable-magic
perl-www-robotrules
perl-xml-libxml
perl-xml-libxml-simple
perl-xml-libxslt
perl-xml-namespacesupport
perl-xml-parser
perl-xml-sax
perl-xml-sax-base
perl-xml-sax-expat
perl-xml-simple
perl-xml-writer
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
plasma-activities
playerctl
plymouth
pnpm
polkit
polkit-qt6
pop-icon-theme-git
pop-launcher
pop-sound-theme
poppler
poppler-data
poppler-glib
popt
portaudio
potrace
power-profiles-daemon
print-manager
procps-ng
protobuf
protobuf-c
psmisc
python
python-argcomplete
python-attrs
python-autocommand
python-cairo
python-certifi
python-cffi
python-charset-normalizer
python-cryptography
python-dbus
python-defusedxml
python-filelock
python-gobject
python-idna
python-jaraco.classes
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jeepney
python-keyring
python-legacy-cgi
python-lxml
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-packaging
python-pip
python-platformdirs
python-psutil
python-pycparser
python-pycups
python-pygments
python-pyqt6
python-pyqt6-sip
python-pyxdg
python-requests
python-secretstorage
python-setproctitle
python-setuptools
python-tqdm
python-urllib3
python-wheel
qca-qt6
qcustomplot
qhexedit2
qpdf
qrencode
qscintilla-qt5
qt5-base
qt5-translations
qt6-5compat
qt6-base
qt6-declarative
qt6-scxml
qt6-shadertools
qt6-svg
qt6-tools
qt6-translations
qt6-wayland
raptor
rasqal
rav1e
readline
redland
ripgrep
rsync
rtkit
rtmpdump
rubberband
run-parts
runc
rust
rygel
sane
sbc
sdl12-compat
sdl2-compat
sdl2_ttf
sdl3
seatd
sed
semver
serd
shaderc
shadow
shared-mime-info
simdjson
simple-scan
slang
smbclient
snap-pac
snapd
snapd-glib
snapd-glib-debug
snapper
snappy
snapshot
socat
sof-firmware
solid
sord
sound-theme-freedesktop
soundtouch
spandsp
speech-dispatcher
speex
speexdsp
spirv-tools
sqlcipher
sqlite
sqlitebrowser
squashfs-tools
sratom
srt
sshfs
startup-notification
sudo
suitesparse
superproductivity-bin
sushi
svt-av1
svt-hevc
switcheroo-control
system-config-printer
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tcl
tdb
tecla
tevent
texinfo
texlive-basic
texlive-bin
texlive-latex
texlive-latexrecommended
timeshift
timeshift-autosnap
tinysparql
totem
totem-pl-parser
tpm2-tss
tree-sitter
tree-sitter-bash
tree-sitter-c
tree-sitter-cli
tree-sitter-javascript
tree-sitter-lua
tree-sitter-markdown
tree-sitter-python
tree-sitter-query
tree-sitter-rust
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-opensans
twolame
tzdata
uchardet
udisks2
unibilium
unzip
upower
usbmuxd
util-linux
util-linux-libs
v4l-utils
vala
vapoursynth
vid.stab
vim
vim-runtime
virtualbox
virtualbox-guest-iso
virtualbox-host-dkms
vmaf
volume_key
vte-common
vte3
vte4
vulkan-icd-loader
vulkan-intel
wavpack
wayland
webcord-bin
webkit2gtk-4.1
webkitgtk-6.0
webrtc-audio-processing-1
wget
which
wildmidi
wireplumber
wl-clip-persist
wl-clipboard
woff2
wofi
wpa_supplicant
wsdd
x264
x265
xapp
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-cosmic
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xkeyboard-config
xmlsec
xorg-fonts-encodings
xorg-server-common
xorg-setxkbmap
xorg-xdpyinfo
xorg-xhost
xorg-xkbcomp
xorg-xmodmap
xorg-xprop
xorg-xrdb
xorg-xset
xorg-xwayland
xorgproto
xvidcore
xxhash
xz
yay
yay-debug
yelp
yelp-xsl
yt-dlp
yyjson
zbar
zeromq
zimg
zix
zlib
zlib-ng
zram-generator
zsh
zsh-autocomplete
zsh-completions
zstd
zvbi
zxing-cpp
zziplib
