alsa-firmware
alsa-utils
avisynthplus
baobab
base
base-devel
biber
bottom
btrfs-progs
code
discord
efibootmgr
epiphany
evince
fastfetch
firefox
fprintd
fwupd
gcolor3
gdm
gdu
ghostty
gimp
git
github-cli
gnome-backgrounds
gnome-calculator
gnome-calendar
gnome-characters
gnome-clocks
gnome-color-manager
gnome-connections
gnome-console
gnome-contacts
gnome-control-center
gnome-disk-utility
gnome-font-viewer
gnome-keyring
gnome-logs
gnome-maps
gnome-menus
gnome-music
gnome-remote-desktop
gnome-session
gnome-settings-daemon
gnome-shell
gnome-shell-extensions
gnome-software
gnome-system-monitor
gnome-text-editor
gnome-tour
gnome-tweaks
gnome-user-docs
gnome-user-share
gnome-weather
grilo-plugins
gst-libav
gst-plugin-pipewire
gvfs
gvfs-afc
gvfs-dnssd
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-onedrive
gvfs-smb
gvfs-wsdd
htop
hunspell-en_us
inkscape
intel-media-driver
intel-media-sdk
intel-ucode
iwd
keyd
ladspa
lazygit
lib32-opus
libpulse
libreoffice-fresh
libva-intel-driver
linux
linux-firmware
loupe
malcontent
man-db
man-pages
nano
nautilus
neovim
network-manager-applet
networkmanager
nodejs
npm
orca
pandoc-cli
perl-datetime
perl-datetime-format-builder
perl-parse-recdescent
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
pnpm
power-profiles-daemon
python-pandas
python-pip
python-pipx
python-pylatexenc
python-scikit-learn
ruby
rygel
simple-scan
smartmontools
snapper
snapshot
sof-firmware
sushi
system-config-printer
tecla
texlive-luatex
thunderbird
totem
tree-sitter-cli
udiskie
vim
vpl-gpu-rt
vulkan-intel
wget
wireless_tools
wireplumber
xdg-desktop-portal-gnome
xdg-user-dirs-gtk
xdg-utils
xorg-server
xorg-xinit
yelp
zram-generator
