adwaita-dark
backintime
baobab
base
base-devel
biber
bottom
breeze-icons
btop
btrfs-progs
code
cosmic-app-library
cosmic-applet-arch
cosmic-applets
cosmic-bg
cosmic-comp
cosmic-files
cosmic-greeter
cosmic-icon-theme
cosmic-idle
cosmic-launcher
cosmic-notifications
cosmic-osd
cosmic-panel
cosmic-randr
cosmic-screenshot
cosmic-session
cosmic-settings
cosmic-settings-daemon
cosmic-wallpapers
cosmic-workspaces
cups
cups-browsed
decibels
docker
efibootmgr
epiphany
evince
fastfetch
firefox
gdm
gdu
gimp
git
gnome-backgrounds
gnome-calculator
gnome-calendar
gnome-characters
gnome-clocks
gnome-color-manager
gnome-connections
gnome-control-center
gnome-disk-utility
gnome-font-viewer
gnome-icon-theme-extras
gnome-keyring
gnome-logs
gnome-maps
gnome-menus
gnome-music
gnome-remote-desktop
gnome-session
gnome-settings-daemon
gnome-shell
gnome-shell-extension-desktop-icons-ng
gnome-shell-extensions
gnome-software
gnome-system-monitor
gnome-text-editor
gnome-tour
gnome-tweaks
gnome-user-docs
gnome-user-share
gnome-weather
grilo-plugins
gst-plugin-pipewire
gvfs
gvfs-afc
gvfs-dnssd
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-onedrive
gvfs-smb
gvfs-wsdd
intel-ucode
iwd
keyd
kitty
latex2html
lazygit
libpulse
libreoffice-still
linux
linux-firmware
loupe
malcontent
man-db
man-pages
minimon-applet-for-cosmic
mpv
nautilus
neovim
networkmanager-iwd-overlay
nodejs
npm
orca
oxygen-icons
pam-fprint-grosshack-unlimited-timeout
pamac-all
pandoc-cli
perl-datetime
perl-datetime-format-builder
perl-parse-recdescent
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
plymouth
pnpm
power-profiles-daemon
print-manager
python-pip
rygel
simple-scan
snap-pac
snapshot
socat
sof-firmware
sqlitebrowser
superproductivity-bin
sushi
system-config-printer
tecla
texlive-latex
texlive-latexrecommended
timeshift
timeshift-autosnap
totem
tree-sitter-bash
tree-sitter-cli
tree-sitter-javascript
tree-sitter-python
tree-sitter-rust
vim
virtualbox
webcord-bin
wget
wireplumber
wl-clip-persist
wl-clipboard
wofi
xdg-desktop-portal-cosmic
xdg-desktop-portal-gnome
xdg-user-dirs-gtk
xorg-xhost
yay
yay-debug
yelp
zram-generator
zsh-autocomplete
